docs/1c-export-2026-06-02/Catalogs/НастройкиViber.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>НастройкиViber</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПриветствия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зарегистрирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UrlViber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиЛогированиеЗапросов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиИсториюПереписки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UriИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаБот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелНом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДляОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДляСохранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-2026-06-02/HTTPServices/Боты/Ext/Module.bsl
Функция pingGETping(Запрос)
	
	Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет();
	
КонецФункции

Функция SendPOSTSend(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	НастройкиВайбер = Справочники.НастройкиViber.НайтиПоРеквизиту("Метод", "Send");

	Попытка
		Ответ = МодульУправленияViber.ОбработатьВходящийЗапрос(Запрос, НастройкиВайбер);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Ответ = ОбщегоНазначенияHTTPViber.ОтветОбОшибке(ИнформацияОбОшибке);
	КонецПопытки;
	
	Если НастройкиВайбер.ВестиЛогированиеЗапросов Тогда
		ОбщегоНазначенияHTTPViber.ЗаписьЛогированияЗапросов("Send", Запрос, Ответ);
	КонецЕсли;	

	Возврат Ответ;
	
КонецФункции

Функция SendSecondPOSTSend(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Ответ = МодульУправленияViber.ОбработатьВходящийЗапросSECOND(Запрос);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Ответ = ОбщегоНазначенияHTTPViber.ОтветОбОшибке(ИнформацияОбОшибке);
	КонецПопытки;
	
	НастройкиВайбер = Справочники.НастройкиViber.НайтиПоРеквизиту("Метод", "SendSecond");
	Если НастройкиВайбер.ВестиЛогированиеЗапросов Тогда
		ОбщегоНазначенияHTTPViber.ЗаписьЛогированияЗапросовВторойМетод("Send", Запрос, Ответ);
	КонецЕсли;	

	Возврат Ответ; 
	
КонецФункции


/////// Мобильный обмен ////////////////////////////
Функция exchangePOSTSendExchange(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Ответ = ViberОбмен.ОбработатьВходящийЗапрос(Запрос);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Ответ = ViberОбмен.ОтветОбОшибке(ИнформацияОбОшибке);
	КонецПопытки;
	
	//ViberОбмен.ЗаписьЛогированияЗапросов("Send", Запрос, Ответ);
	
	Возврат Ответ;
	

КонецФункции
